fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ВКМ_НачисленияЗарплаты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_НачисленияЗарплаты</name>
  <registerRecords>CalculationRegister.ВКМ_ОсновныеНачисления</registerRecords>
  <registerRecords>CalculationRegister.ВКМ_Удержания</registerRecords>
  <registerRecords>AccumulationRegister.ВКМ_ВзаиморасчетыССотрудниками</registerRecords>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Начисления</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_ОсновныеНачисления</types>
      </type>
    </attributes>
    <attributes>
      <name>НачалоПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КонецПериода</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Дни</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Показатель</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>12</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>НДФЛ</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_ФизическиеЛица</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидРасчета</name>
      <type>
        <types>ChartOfCalculationTypesRef.ВКМ_Удержания</types>
      </type>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

fonecmid-diplom/src/CalculationRegisters/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_ОсновныеНачисления</name>
  <periodicity>Month</periodicity>
  <actionPeriod>true</actionPeriod>
  <basePeriod>true</basePeriod>
  <schedule>InformationRegister.ВКМ_ГрафикиРабот</schedule>
  <scheduleValue>InformationRegister.ВКМ_ГрафикиРабот.Resource.Значение</scheduleValue>
  <scheduleDate>InformationRegister.ВКМ_ГрафикиРабот.Dimension.Дата</scheduleDate>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Дни</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ГрафикРаботы</name>
    <type>
      <types>CatalogRef.ВКМ_ГрафикиРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/CalculationRegisters/ВКМ_Удержания/ВКМ_Удержания.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:CalculationRegister>
  <name>ВКМ_Удержания</name>
  <periodicity>Month</periodicity>
  <basePeriod>true</basePeriod>
  <chartOfCalculationTypes>ChartOfCalculationTypes.ВКМ_Удержания</chartOfCalculationTypes>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Показатель</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <dimensions>
    <name>Сотрудник</name>
    <type>
      <types>CatalogRef.ВКМ_ФизическиеЛица</types>
    </type>
  </dimensions>
</mdclass:CalculationRegister>

fonecmid-diplom/src/Catalogs/ВКМ_ГрафикиРабот/ВКМ_ГрафикиРабот.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ВКМ_ГрафикиРабот</name>
  <predefined>
    <items>
      <name>Пятидневка</name>
      <description>Пятидневка</description>
    </items>
    <items>
      <name>КалендарныеДни</name>
      <description>Календарные дни</description>
    </items>
  </predefined>
</mdclass:Catalog>

fonecmid-diplom/src/ChartsOfCalculationTypes/ВКМ_ОсновныеНачисления/ВКМ_ОсновныеНачисления.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCalculationTypes>
  <name>ВКМ_ОсновныеНачисления</name>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ОсновныеНачисления</baseCalculationTypes>
  <baseCalculationTypes>ChartOfCalculationTypes.ВКМ_ДополнительныеНачисления</baseCalculationTypes>
  <predefined>
    <items>
      <name>Оклад</name>
      <description>Оклад</description>
    </items>
    <items>
      <name>Отпуск</name>
      <description>Отпуск</description>
    </items>
    <items>
      <name>ПроцентЗаВыполненыеРаботы</name>
      <description>Процент за выполненые работы</description>
    </items>
  </predefined>
</mdclass:ChartOfCalculationTypes>

fonecmid-diplom/src/Documents/ВКМ_НачисленияЗарплаты/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Ответственный = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, РежимПроведения)

	СформироватьДвиженияОсновныхНачислений();    
	СформироватьЗаписиСторно();    

	Движения.ВКМ_ОсновныеНачисления.Записать();
	
	РассчитатьОклад();
	РассчитатьОтпуск();
	
	СформироватьДвиженияУдержаний();    
	РассчитатьНДФЛ();
//
//	// регистр ВКМ_ВзаиморасчетыССотрудниками
//	Движения.ВКМ_ВзаиморасчетыССотрудниками.Записывать = Истина;
//	Для Каждого ТекСтрокаНачисления из Начисления Цикл
//		Движение = Движения.ВКМ_ВзаиморасчетыССотрудниками.Добавить();
//		Движение.Период = Дата;
//		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
//		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
//		Движение.Сумма = 0;
//	КонецЦикла;
//
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	//Данный фрагмент построен конструктором.
	//При повторном использовании конструктора, внесенные вручную данные будут утеряны!

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура СформироватьДвиженияОсновныхНачислений()
	
	ГрафикПятидневка = Справочники.ВКМ_ГрафикиРабот.Пятидневка;
	ГрафикКалендарныеДни = Справочники.ВКМ_ГрафикиРабот.КалендарныеДни;
	
	// регистр ВКМ_ОсновныеНачисления
	Движения.ВКМ_ОсновныеНачисления.Записывать = Истина;

	Для Каждого ТекСтрокаНачисления из Начисления Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ТекСтрокаНачисления.ВидРасчета;
		Движение.ПериодРегистрации = Дата;
		Движение.ПериодДействияНачало = ТекСтрокаНачисления.НачалоПериода;
		Движение.ПериодДействияКонец = ТекСтрокаНачисления.КонецПериода;
		Движение.Сотрудник = ТекСтрокаНачисления.Сотрудник;
		Движение.Сумма = 0;
		Движение.Дни = 0;
		Если Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад Тогда
			Движение.БазовыйПериодНачало = ТекСтрокаНачисления.НачалоПериода;
			Движение.БазовыйПериодКонец = ТекСтрокаНачисления.КонецПериода;
			Движение.Показатель = ТекСтрокаНачисления.Показатель;
			Движение.ГрафикРаботы = ГрафикПятидневка;
		ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск Тогда
			Движение.БазовыйПериодНачало = ДобавитьМесяц(ТекСтрокаНачисления.НачалоПериода,-12);
			Движение.БазовыйПериодКонец = ДобавитьМесяц(ТекСтрокаНачисления.КонецПериода,-1);
			Движение.ГрафикРаботы = ГрафикКалендарныеДни;
		ИначеЕсли Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_ОсновныеНачисления.ПроцентЗаВыполненыеРаботы Тогда
			Движение.Показатель = ТекСтрокаНачисления.Показатель;
			Движение.Сумма = Движение.Показатель;
		КонецЕсли;
	КонецЦикла;

КонецПроцедуры

Процедура СформироватьЗаписиСторно()

	СторноЗаписи = Движения.ВКМ_ОсновныеНачисления.ПолучитьДополнение();
	
	Для каждого Запись Из СторноЗаписи Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления.Добавить();
		ЗаполнитьЗначенияСвойств(Движение,Запись);
		
		Движение.ПериодДействияНачало = Запись.ПериодДействияНачалоСторно;
		Движение.ПериодДействияКонец = Запись.ПериодДействияКонецСторно;
		Движение.ПериодРегистрации = Дата;  
		Движение.Сумма = 0;
		Движение.Дни = 0;      
		Движение.Сторно = Истина;
	КонецЦикла;
	
КонецПроцедуры           


Процедура РассчитатьОклад()

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияДанныеГрафика.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеПериодДействия КАК План,
		|	ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия КАК Факт
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(ВидРасчета = &ВидРасчета
		|	И Регистратор = &Регистратор) КАК ОсновныеНачисленияДанныеГрафика";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Оклад);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл

		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];

		Если Выборка.План <> 0 Тогда

			Движение.Сумма = Движение.Показатель * Выборка.Факт / Выборка.План;

			Движение.Дни = Выборка.Факт; 
			
			Если Движение.Сторно Тогда
				Движение.Сумма = -Движение.Сумма;
				Движение.Дни = -Движение.Дни;
			КонецЕсли;
		
			СтрокаНачисления = Начисления[Выборка.НомерСтроки - 1];
			СтрокаНачисления.Сумма = Движение.Сумма; 
			СтрокаНачисления.Дни = Движение.Дни;

		КонецЕсли;
		
	КонецЦикла;
	
	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры           

Процедура РассчитатьОтпуск()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОсновныеНачисленияБазаОсновныеНачисления.НомерСтроки КАК НомерСтроки,
		|	ОсновныеНачисленияБазаОсновныеНачисления.СуммаБаза КАК СуммаБаза,
		|	ОсновныеНачисленияБазаОсновныеНачисления.ДниБаза КАК ДниБаза,
		|	ЕСТЬNULL(ОсновныеНачисленияДанныеГрафика.ЗначениеФактическийПериодДействия, 0) КАК ДниОтпуска
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления.БазаВКМ_ОсновныеНачисления(
		|			&Измерения,
		|			&Измерения,
		|			,
		|			ВидРасчета = &ВидРасчета
		|				И Регистратор = &Регистратор) КАК ОсновныеНачисленияБазаОсновныеНачисления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрРасчета.ВКМ_ОсновныеНачисления.ДанныеГрафика(
		|				ВидРасчета = &ВидРасчета
		|					И Регистратор = &Регистратор) КАК ОсновныеНачисленияДанныеГрафика
		|		ПО ОсновныеНачисленияБазаОсновныеНачисления.Сотрудник = ОсновныеНачисленияДанныеГрафика.Сотрудник
		|			И ОсновныеНачисленияБазаОсновныеНачисления.ПериодДействияНачало = ОсновныеНачисленияДанныеГрафика.ПериодДействияНачало";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_ОсновныеНачисления.Отпуск);
	
	Измерения = Новый Массив(1);
	Измерения[0] = "Сотрудник";
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_ОсновныеНачисления[Выборка.НомерСтроки - 1];
		
		Если Выборка.ДниБаза <> 0 Тогда                               
			СреднийЗаработок = Выборка.СуммаБаза / Выборка.ДниБаза;
			Движение.Сумма = СреднийЗаработок * Выборка.ДниОтпуска;
			Движение.Дни = Выборка.ДниОтпуска;
			Движение.Показатель = СреднийЗаработок;
			
			СтрокаНачисления = Начисления[Выборка.НомерСтроки - 1];
			СтрокаНачисления.Сумма = Движение.Сумма;
			СтрокаНачисления.Дни = Движение.Дни; 
			СтрокаНачисления.Показатель = Движение.Показатель; 
			
		КонецЕсли;
			
	КонецЦикла;

	Движения.ВКМ_ОсновныеНачисления.Записать(, Истина);
	
КонецПроцедуры           

Процедура СформироватьДвиженияУдержаний()
	// регистр ВКМ_Удержания
	Движения.ВКМ_Удержания.Записывать = Истина;

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОсновныеНачисления.Сотрудник КАК Сотрудник
		|ИЗ
		|	РегистрРасчета.ВКМ_ОсновныеНачисления КАК ВКМ_ОсновныеНачисления
		|ГДЕ
		|	ВКМ_ОсновныеНачисления.Регистратор = &Регистратор
		|СГРУППИРОВАТЬ ПО
		|	ВКМ_ОсновныеНачисления.Сотрудник
		|
		|УПОРЯДОЧИТЬ ПО
		|	Сотрудник";
	
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания.Добавить();
		Движение.Сторно = Ложь;
		Движение.ВидРасчета = ПланыВидовРасчета.ВКМ_Удержания.НДФЛ;
		Движение.ПериодРегистрации = Дата;
		Движение.БазовыйПериодНачало = НачалоМесяца(НачалоДня(Дата));
		Движение.БазовыйПериодКонец = КонецМесяца(КонецДня(Дата));
		Движение.Сотрудник = Выборка.Сотрудник;
		Движение.Сумма = 0;
		Движение.Показатель = 13;
	КонецЦикла;
	
	Движения.ВКМ_Удержания.Записать();
	
КонецПроцедуры

Процедура РассчитатьНДФЛ()

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.НомерСтроки,
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.СуммаБаза,
		|	ВКМ_УдержанияБазаВКМ_ОсновныеНачисления.Показатель
		|ИЗ
		|	РегистрРасчета.ВКМ_Удержания.БазаВКМ_ОсновныеНачисления(&Измерения, &Измерения,, Регистратор = &Регистратор
		|	И ВидРасчета = &ВидРасчета) КАК ВКМ_УдержанияБазаВКМ_ОсновныеНачисления";
	
	Запрос.УстановитьПараметр("ВидРасчета", ПланыВидовРасчета.ВКМ_Удержания.НДФЛ);
	
	Измерения = Новый Массив(1);
	Измерения[0] = "Сотрудник";
	
	Запрос.УстановитьПараметр("Измерения", Измерения);
	Запрос.УстановитьПараметр("Регистратор", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	НДФЛ.Очистить();
	
	Пока Выборка.Следующий() Цикл
		Движение = Движения.ВКМ_Удержания[Выборка.НомерСтроки - 1];
		
		Если Выборка.СуммаБаза <> 0 Тогда                               
			Движение.Сумма = Окр(Выборка.СуммаБаза * Выборка.Показатель / 100, 0, 1);
			
			СтрокаУдержания = НДФЛ.Добавить();
			СтрокаУдержания.ВидРасчета = Движение.ВидРасчета;
			СтрокаУдержания.Сотрудник = Движение.Сотрудник;
			СтрокаУдержания.Сумма = Движение.Сумма; 
		КонецЕсли;
		
	КонецЦикла;

	Движения.ВКМ_Удержания.Записать( , Истина);
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
